app/controllers/gists_controller.rb

SELECT COUNT(*) FROM "gists"
---
  def index
    @gists = Gist.paginate(page: params[:page], per_page: 10).order('created_at DESC')

SELECT "gists".* FROM "gists" WHERE (lang LIKE '%css%' AND description LIKE '%aaaa%')
---
  def search
    @gists = @gists = Gist.search(params[:lang],params[:desc])

INSERT INTO "gists" ("created_at", "description", "lang", "snippet", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 19 Mar 2014 22:58:25 UTC +00:00], ["description", "s"], ["lang", "abap"], ["snippet", "s"], ["updated_at", Wed, 19 Mar 2014 22:58:25 UTC +00:00]]
---
  def create
    @gist = Gist.new(change_lang(gist_params))
    #@gist.lang = change_lang(@gist.lang)

    respond_to do |format|
      if @gist.save

UPDATE "gists" SET "lang" = ?, "updated_at" = ? WHERE "gists"."id" = 1  [["lang", "antlr with ruby target"], ["updated_at", Wed, 19 Mar 2014 23:46:13 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @gist.update(change_lang(gist_params))

DELETE FROM "gists" WHERE "gists"."id" = ?  [["id", 11]]
---
  def destroy
    @gist.destroy